In [2]:
# Use python to download all the txt files from April - June 2019

import pandas as pd
import urllib.request

In [4]:
# Scrape mta website for turnstile entries and exits within aformentioned date range, from respective text files

url = "http://web.mta.info/developers/data/nyct/turnstile/turnstile_{}.txt"
week_nums = [190406, 190413, 190420, 190427, 190504, 190511, 190518, 190525, 190601,
190608, 190615, 190622, 190629]

for week_num in week_nums:
    urllib.request.urlretrieve(f"http://web.mta.info/developers/data/nyct/turnstile/turnstile_{week_num}.txt", f"/Users/joshua.claxton/Documents/Metis_projects/project_1/data/turnstile_{week_num}.txt")

In [5]:
# Extract data to pandas using sqlalchemy

from sqlalchemy import create_engine

In [18]:
engine = create_engine("sqlite:////Users/joshua.claxton/Documents/Metis_projects/project_1/data/mta.db")

In [19]:
all_data = pd.read_sql('SELECT * FROM mta_data;', engine)

In [21]:
all_data.head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/30/2019,00:00:00,REGULAR,6999064,2373568
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/30/2019,04:00:00,REGULAR,6999084,2373576
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/30/2019,08:00:00,REGULAR,6999107,2373622
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/30/2019,12:00:00,REGULAR,6999214,2373710
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,03/30/2019,16:00:00,REGULAR,6999451,2373781

In [22]:
all_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2664249 entries, 0 to 2664248
Data columns (total 11 columns):
 #   Column    Dtype
---  ------    -----
 0   C/A       object
 1   UNIT      object
 2   SCP       object
 3   STATION   object
 4   LINENAME  object
 5   DIVISION  object
 6   DATE      object
 7   TIME      object
 8   DESC      object
 9   ENTRIES   int64
 10  EXITS     int64
dtypes: int64(2), object(9)
memory usage: 223.6+ MB